Product/trunk/DDPs/Framework/IIS/xml/notify-oc.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:oc="http://www.tmforum.org/mtop/fmw/xsd/oc/v1" xmlns:cei="http://www.tmforum.org/mtop/fmw/xsd/cei/v1" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1" xsi:schemaLocation="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1 ../xsd/HeaderDefinitions.xsd http://www.tmforum.org/mtop/fmw/xsd/oc/v1 ../xsd/EventObjectCreation.xsd http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1 ../xsd/NotificationMessages.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <m:header xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1">
      <m:activityName>Notification</m:activityName>
      <m:msgName>notify</m:msgName>
      <m:msgType>NOTIFICATION</m:msgType>
      <m:senderURI>http://www.altova.com</m:senderURI>
      <m:destinationURI>http://www.altova.com</m:destinationURI>
      <m:security>String</m:security>
      <m:securityType>String</m:securityType>
      <m:priority>String</m:priority>
      <m:msgSpecificProperties>
        <m:property>
          <m:propName>String</m:propName>
          <m:propValue>String</m:propValue>
        </m:property>
      </m:msgSpecificProperties>
      <m:communicationPattern>Notification</m:communicationPattern>
      <m:communicationStyle>MSG</m:communicationStyle>
      <m:timestamp>2001-12-17T09:30:47.0Z</m:timestamp>
      <m:vendorExtensions/>
    </m:header>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <m:notify xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1">
      <m:topic>String</m:topic>
      <m:message>
        <oc:objectCreation>
          <cei:notificationId>String</cei:notificationId>
          <cei:osTime>2001-12-17T09:30:47.0Z</cei:osTime>
          <cei:vendorExtensions/>
          <oc:objectType>ME</oc:objectType>
          <oc:objectName>
            <nam:object>
              <nam:type>MD</nam:type>
              <nam:name>Company/String</nam:name>
            </nam:object>
            <nam:object>
              <nam:type>ME</nam:type>
              <nam:name>String</nam:name>
            </nam:object>
          </oc:objectName>
          <oc:object>
            <me:me xmlns:coi="http://www.tmforum.org/mtop/fmw/xsd/coi/v1" xmlns:cri="http://www.tmforum.org/mtop/nrb/xsd/cri/v1" xmlns:lay="http://www.tmforum.org/mtop/nrb/xsd/lay/v1" xmlns:me="http://www.tmforum.org/mtop/nrf/xsd/me/v1">
              <coi:name>
                <nam:object>
                  <nam:type>MD</nam:type>
                  <nam:name>Company/String</nam:name>
                </nam:object>
                <nam:object>
                  <nam:type>ME</nam:type>
                  <nam:name>String</nam:name>
                </nam:object>
              </coi:name>
              <coi:userLabel>String</coi:userLabel>
              <coi:discoveredName>String</coi:discoveredName>
              <coi:namingOS>String</coi:namingOS>
              <coi:owner>String</coi:owner>
              <coi:aliasNameList>
                <coi:alias>
                  <coi:aliasName>String</coi:aliasName>
                  <coi:aliasValue>String</coi:aliasValue>
                </coi:alias>
              </coi:aliasNameList>
              <coi:vendorExtensions>
                <nt:jane xmlns:nt="www.jane.com/mtosi/xsd/me">
                  <nt:att1>123</nt:att1>
                  <nt:att2>String</nt:att2>
                </nt:jane>
                <nt:joe xmlns:nt="www.joe.com/mtosi/xsd/me">
                  <nt:att1>String</nt:att1>
                  <nt:att2>true</nt:att2>
                </nt:joe>
              </coi:vendorExtensions>
              <cri:source>networkEMS</cri:source>
              <cri:resourceState>PLANNED</cri:resourceState>
              <me:location>String</me:location>
              <me:manufacturer>String</me:manufacturer>
              <me:productName>String</me:productName>
              <me:version>String</me:version>
              <me:InSyncState>true</me:InSyncState>
              <me:supportedRates>
                <lay:layerRate extension="PROP_MYLAYER">VENDOR_EXT</lay:layerRate>
              </me:supportedRates>
              <me:communicationState>CS_AVAILABLE</me:communicationState>
              <me:networkAccessDomain>String</me:networkAccessDomain>
            </me:me>
          </oc:object>
        </oc:objectCreation>
      </m:message>
    </m:notify>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
